## Merging Datasets

In [1]:
import pandas as pd

df = pd.DataFrame([{'Name': 'Chris', 'Item Purchased': 'Sponge', 'Cost': 22.50},
                   {'Name': 'Kevyn', 'Item Purchased': 'Kitty Litter', 'Cost': 2.50},
                   {'Name': 'Filip', 'Item Purchased': 'Spoon', 'Cost': 5.00}],
                  index=['Store 1', 'Store 1', 'Store 2'])
df

          Name Item Purchased  Cost
Store 1  Chris         Sponge  22.5
Store 1  Kevyn   Kitty Litter   2.5
Store 2  Filip          Spoon   5.0

In [2]:
df['Date'] = ['Dec 1', 'Jan 1', 'mid-May']
df

          Name Item Purchased  Cost     Date
Store 1  Chris         Sponge  22.5    Dec 1
Store 1  Kevyn   Kitty Litter   2.5    Jan 1
Store 2  Filip          Spoon   5.0  mid-May

In [3]:
df['Delivered'] = True
df

          Name Item Purchased  Cost     Date  Delivered
Store 1  Chris         Sponge  22.5    Dec 1       True
Store 1  Kevyn   Kitty Litter   2.5    Jan 1       True
Store 2  Filip          Spoon   5.0  mid-May       True

In [4]:
df['Feedback'] = ['Positive', None, 'Negative']
df

          Name Item Purchased  Cost     Date  Delivered  Feedback
Store 1  Chris         Sponge  22.5    Dec 1       True  Positive
Store 1  Kevyn   Kitty Litter   2.5    Jan 1       True      None
Store 2  Filip          Spoon   5.0  mid-May       True  Negative

In [5]:
adf = df.reset_index()
adf

     index   Name Item Purchased  Cost     Date  Delivered  Feedback
0  Store 1  Chris         Sponge  22.5    Dec 1       True  Positive
1  Store 1  Kevyn   Kitty Litter   2.5    Jan 1       True      None
2  Store 2  Filip          Spoon   5.0  mid-May       True  Negative

In [7]:
adf['Date'] = pd.Series({0: 'Dec 1', 2: 'Mid-May'})
adf

     index   Name Item Purchased  Cost     Date  Delivered  Feedback
0  Store 1  Chris         Sponge  22.5    Dec 1       True  Positive
1  Store 1  Kevyn   Kitty Litter   2.5      NaN       True      None
2  Store 2  Filip          Spoon   5.0  Mid-May       True  Negative

In [10]:
staff_df = pd.DataFrame([{'Name': 'Kelly', 'Role': 'Director of HR'},
                         {'Name': 'Sally', 'Role': 'Course liasion'},
                         {'Name': 'James', 'Role': 'Grader'}])
staff_df = staff_df.set_index('Name')
staff_df

                 Role
Name
Kelly  Director of HR
Sally  Course liasion
James          Grader

In [11]:
student_df = pd.DataFrame([{'Name': 'James', 'School': 'Business'},
                           {'Name': 'Mike', 'School': 'Law'},
                           {'Name': 'Sally', 'School': 'Engineering'}])
student_df = student_df.set_index('Name')
student_df

            School
Name
James     Business
Mike           Law
Sally  Engineering

### Merging two DF along the *same* index

In [12]:
# join 2 DFs using outter join, use left index and right index

pd.merge(staff_df, student_df, how='outer', left_index=True, right_index=True)

                 Role       School
Name
James          Grader     Business
Kelly  Director of HR          NaN
Mike              NaN          Law
Sally  Course liasion  Engineering

In [13]:
pd.merge(staff_df, student_df, how='inner', left_index=True, right_index=True)

                 Role       School
Name
Sally  Course liasion  Engineering
James          Grader     Business

In [14]:
# left join -- i.e. get all staffs but if they're students (there is a match in student table)
# show their student's details as well

pd.merge(staff_df, student_df, how='left', left_index=True, right_index=True)

                 Role       School
Name
Kelly  Director of HR          NaN
Sally  Course liasion  Engineering
James          Grader     Business

In [15]:
# list of all students + their roles if they're also staffs
pd.merge(staff_df, student_df, how='right', left_index=True, right_index=True)

                 Role       School
Name
James          Grader     Business
Mike              NaN          Law
Sally  Course liasion  Engineering

Doesn't always have to join on *indexes*, can also join on *columns*

In [16]:
staff_df = staff_df.reset_index()
student_df = student_df.reset_index()
pd.merge(staff_df, student_df, how='left', left_on='Name', right_on='Name')

    Name            Role       School
0  Kelly  Director of HR          NaN
1  Sally  Course liasion  Engineering
2  James          Grader     Business

In [19]:
pd.merge(staff_df, student_df, how='left', left_on='Name', right_on='School')

  Name_x            Role Name_y School
0  Kelly  Director of HR    NaN    NaN
1  Sally  Course liasion    NaN    NaN
2  James          Grader    NaN    NaN

#### When DFs have conflicting information

Here, location for `student_df` is personal address whereas for staff, it's work address

In [21]:
staff_df = pd.DataFrame([{'Name': 'Kelly', 'Role': 'Director of HR', 'Location': 'State Street'},
                         {'Name': 'Sally', 'Role': 'Course liasion', 'Location': 'Washington Avenue'},
                         {'Name': 'James', 'Role': 'Grader', 'Location': 'Washington Avenue'}])
student_df = pd.DataFrame([{'Name': 'James', 'School': 'Business', 'Location': '1024 Billiard Avenue'},
                           {'Name': 'Mike', 'School': 'Law', 'Location': 'Fraternity House #22'},
                           {'Name': 'Sally', 'School': 'Engineering', 'Location': '512 Wilson Crescent'}])
staff_df

    Name            Role           Location
0  Kelly  Director of HR       State Street
1  Sally  Course liasion  Washington Avenue
2  James          Grader  Washington Avenue

In [22]:
student_df

    Name       School              Location
0  James     Business  1024 Billiard Avenue
1   Mike          Law  Fraternity House #22
2  Sally  Engineering   512 Wilson Crescent

In [24]:
pd.merge(staff_df, student_df, how='left', left_on='Name', right_on='Name')

    Name            Role         Location_x       School            Location_y
0  Kelly  Director of HR       State Street          NaN                   NaN
1  Sally  Course liasion  Washington Avenue  Engineering   512 Wilson Crescent
2  James          Grader  Washington Avenue     Business  1024 Billiard Avenue

In [25]:
staff_df = pd.DataFrame([{'First Name': 'Kelly', 'Last Name': 'Desjardins', 'Role': 'Director of HR'},
                         {'First Name': 'Sally', 'Last Name': 'Brooks', 'Role': 'Course liasion'},
                         {'First Name': 'James', 'Last Name': 'Wilde', 'Role': 'Grader'}])
student_df = pd.DataFrame([{'First Name': 'James', 'Last Name': 'Hammond', 'School': 'Business'},
                           {'First Name': 'Mike', 'Last Name': 'Smith', 'School': 'Law'},
                           {'First Name': 'Sally', 'Last Name': 'Brooks', 'School': 'Engineering'}])

In [26]:
staff_df

  First Name   Last Name            Role
0      Kelly  Desjardins  Director of HR
1      Sally      Brooks  Course liasion
2      James       Wilde          Grader

In [27]:
student_df

  First Name Last Name       School
0      James   Hammond     Business
1       Mike     Smith          Law
2      Sally    Brooks  Engineering

In [28]:
# The two James have different Last Name, so only Sally Brooks is a match

pd.merge(staff_df, student_df, how='inner', left_on=['First Name','Last Name'], right_on=['First Name','Last Name'])

  First Name Last Name            Role       School
0      Sally    Brooks  Course liasion  Engineering